# Este archivo contiene los comandos necesarios para hacer la 
# sintesis de la maquina de estados Automatic-Parking-Access-Control

# read design 
read_verilog ATM_controller.v

# elaborate design hierarchy
hierarchy -check -top ATM_controller

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# write rtlil design
write_verilog ATM_rtlil.v

# mapping flip-flops to cmos_cells.lib
dfflibmap -liberty ./cmos_cells.lib

# mapping logic to cmos_cells.lib
abc -liberty ./cmos_cells.lib

#Generate GraphViz output
show

# cleanup
clean

# write synthesized design
write_verilog ATM_synth.v